import 'package:flutter/material.dart';

List profileList=[
  'محفظتي ',
  'الاعدادات ',
  'مساعده ',
  'خروج ',
];
List profileIcons=[
  Icons.account_balance_wallet_outlined,
  Icons.settings,
  Icons.help_outline_outlined,
  Icons.logout,
];
List settingList=[
  'الاشعارات ',
   'الخصوصيه والامان ',
   'الشروط و الاحكام ',
 ];
List settingIcons=[
  Icons.add_alert_sharp,
  Icons.security_outlined  ,
  // Icons.checklist_rtl_sharp ,
  Icons.rule_rounded,
 ];
List helpList=[
  'وعند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم ويقول البعض ان وضع النصوص التجريبية بالتصميم قد تشغل المشاهد عن وضع الكثير من الملاحظات او الانتقادات للتصميم الاساسي. وخلافاَ للاعتقاد السائد فإن لوريم إيبسوم ليس نصاَ عشوائياً، بل إن له جذور في الأدب اللاتيني الكلاسيكي منذ العام 45 قبل الميلاد. من كتاب "حول أقاصي الخير والشر"',
  'وعند موافقه العميل المبدئيه على التصميم يتم ازالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة للتصميم ويقول البعض ان وضع النصوص التجريبية بالتصميم قد تشغل المشاهد عن وضع الكثير من الملاحظات او الانتقادات للتصميم الاساسي. وخلافاَ للاعتقاد السائد فإن لوريم إيبسوم ليس نصاَ عشوائياً، بل إن له جذور في الأدب اللاتيني الكلاسيكي منذ العام 45 قبل الميلاد. من كتاب "حول أقاصي الخير والشر"',

];List helpHeadList=[
  'عن لمعتي',
  'كيف تستخدم لمعتي'
];
